---
kind: enumMember
id: F:Autodesk.Revit.DB.GridNodeLocation.Exterior
enum: Autodesk.Revit.DB.GridNodeLocation
source: html/82806a64-e5cf-9c78-675a-9d5ca11bf4b1.htm
---
# Autodesk.Revit.DB.GridNodeLocation.Exterior